//打印九九乘法表(有格式)  
#include<stdio.h>          
int main()            
{
int i=0;
for(i=1;i<=9;i++)
 {
 int j=1;
 for(j=1;j<=i;j++)//要写成j<=i,不能写成j<=9,会打印重复的
 {                         //因为只有当副for()执行完了之后,才会回到主for的调整
                           //当j<=9时,列数会执行9次才执行完
  printf("%d*%d=%-2d ",i,j,i*j);
 }                      //%-2d表示两位数的左对齐(不足两位空格表示)
                       //%2d表示两位数的右对齐,可以依此类推
  printf("\n");
 }
return 0;
}            
           
            
            
                                               
            
                       
            
                        
             
            
                              